{
  "about": "Maratha Mandal Engineering College (MMEC) is located at R.S. No. 104, Halbhavi Village, New Vantmuri Post, Via-Kakati, Belagavi – 591113, Karnataka, India. Established in 1997, it is approved by AICTE and affiliated to VTU, Belagavi. Managed by Maratha Mandal (founded 1931). Website: https://www.mmec.edu.in. Contact: +91 9353364643, info@mmec.edu.in.",
  "at_a_glance": "With a history stretching back over 15 years, providing technical education in a modern educational environment and strong academic staff, Maratha Mandal Engineering College is strongly identified with engineering education in North Karnataka-India. The mission of MMEC is to advance knowledge and educate students in science, technology, and other areas of scholarship that will best serve the nation and the world in the 21st century. The Institute is committed to generating, disseminating, and preserving knowledge, and to working with others to bring this knowledge to bear on the world’s great challenges. MMEC is dedicated to provide its students with an education that combines rigorous academic study and the excitement of discovery with the support and intellectual stimulation of a diverse campus community. We seek to develop in each learner of the MMEC the ability and passion to work wisely, creatively, and effectively for the betterment of the planet. The College started functioning on the 21st of October 1997. The college has been duly sanctioned by the Government of Karnataka vide GO No. ED 32 UK 97′. Maratha Mandal Engineering College is recognized by the All India Council of Technical Education (AICTE), New Delhi vide letter no. F/77-153/220/(E)/ET/96 dated 4th August 1997. The College is affiliated to Visvesvaraya Technological University (VTU), Belgaum. The Maratha Mandal was established in Belgaum in the year 1931 with a motto to serve the society in the field of education. Since inception Maratha Mandal has rendered services in the Primary & Higher Secondary education. Maratha Mandal, in the leadership of Late Shri. Nathajirao Halgekar who proved himself to be an outstanding organizer, a sophisticated statesman, a great thinker, an eminent educationalist and a great visionary, with his sterling character, honesty, integrity and dedication to work, began a new era in 1977 by deciding to start different professional institutions of higher education like Polytechnic, College of Pharmacy (Diploma & Degree), Arts, Commerce, Science & Home Science, Dental, Engineering College in and around Belgaum. Late Shri Nathajirao Halgekar stressed the pragmatic and practicable. The Institute admitted its first students in 1997, years after the approval of its founding charter. Since then, We are demonstrating to the nation that progress is possible against the great problems of today and tomorrow—energy, climate, water, poverty, mega cities, disease—through science and technology deeply informed by wise policy and pursued headlong with the can-do culture of MMEC. We are striving to set a path toward a new future for Indian Industries, through innovative systems, processes, and materials. We strongly believe that Maratha Mandal Engineering College can inspire the next generation of young people, of every background, to understand that science, math, and engineering can give them the exhilarating power to participate, not passively as spectators and consumers, but as the active explorers, entrepreneurs, and inventors who will design the future.",
  "departments": "CSE, ECE, Mechanical, Robotics & AI.",
  "placement_cell": "MMEC provides placement support through a dedicated placement cell that organizes training, internships and campus recruitment. Top recruiters include Infosys, TCS, Accenture and Bosch. Visit https://www.mmec.edu.in/placements for more details.",
  "nirf": "NIRF ranking information not specified; check https://www.mmec.edu.in for latest.",
  "library": "Library facilities available; contact college for details.",
  "gallery": "Photo gallery available on website: https://www.mmec.edu.in/gallery.",
  "e_news_letter": "E-newsletter available; subscribe via website.",
  "facilities_others": "Various facilities including labs, sports, etc.; visit https://www.mmec.edu.in/facilities.",
  "multilingual_books": "Multilingual books available in library.",
  "alumni_cell": "Alumni cell for networking and events.",
  "nsdc": "NSDC training programs available.",
  "contact_us": "Contact: +91 9353364643 | info@mmec.edu.in. Website: https://www.mmec.edu.in"
}
